# lang/ru.py

texts = {
    'title': '🛠️ 3x-ui API Viewer',
    'search_label': '🔍 Поиск:',
    'connect_button': '🔄 Подключиться',
    'export_button': '📤 Экспорт CSV',
    'language_label': 'Выберите язык:',
}

columns_info = {
    "Email": 180,
    "Порт": 60,
    "Протокол": 80,
    "Истекает": 130,
    "Статус": 80,
    "Лимит Трафика": 120,
    "Трафик": 250
}

L = {
    'attempt_label': "Попытка: {} из {}",
    'downloading': "Загрузка: {}%",
    'http_error': "Ошибка HTTP: {}",
    'download_error': "Ошибка: {}",
    'update': "Обновление",
    'update_success': "Обновление успешно завершено. Программа будет перезапущена.",
    'update_error': "Ошибка обновления",
    'apply_update_error': "Не удалось применить обновление:\n{}",
    'update_available': "Доступно обновление",
    'update_prompt': "Найдена новая версия {} \n(текущая {}). \nОбновить сейчас?",
    'yes': "Да",
    'no': "Нет",
    'checking_updates': "Проверка обновлений",
    'checking': "Проверка наличия обновлений...",
    'checking_attempt': "Проверка обновлений... (попытка {}/{})",
    'error': "Ошибка",
    'check_failed': "Не удалось проверить наличие обновлений.",
    'no_update': "Установлена последняя версия.",
    'check_exception': "Ошибка при проверке обновлений:\n{}",
    "settings_title": "Настройки подключения",
    "save_success": "Настройки успешно сохранены.",
    "fill_fields": "Пожалуйста, заполните все поля в настройках.",
    "save": "Сохранить",
    "host": "Хост",
    "path": "Путь",
    "username": "Имя пользователя",
    "password": "Пароль",
    "secret": "Секрет",
    "login_failed": "Не удалось войти",
    "expired": "Просрочено",
    "warning": "Истекает скоро",
    "active": "Активен",
    "no_data": "Нет данных",
    "no_data_to_export": "Нет данных для экспорта",
    "export_done": "Экспорт завершён",
    "data_saved_to": "Данные сохранены в",
}
